import sys
sys.path.append("pp_server")

from pp_server.pp.postprocess.el_pp import PrescriptionPP


input_params = {
   "shape":[],
   "corner":{},
   "row-header":{},
   "column-header":{
      "position":[0, 0, 0, 0],
      "content":[["처방의약품의명칭"], ["1회투약량"], ["1일투여횟수"], ["총투약일수"], ["비고"]],
      "bbox":[
         [[0, 0, 0, 0]],
         [[0, 0, 0, 0]],
         [[0, 0, 0, 0]],
         [[0, 0, 0, 0]]
      ],
      "span":[],
      "score":[[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], ],
   },
   "body":{
      "position":[0, 0, 0, 0],
      "content":[
         [
            "Test1",
            "5,0000",
            "5",
            "5",
            ""
         ],
         [
            "Test2",
            "5.0000",
            "5",
            "5",
            ""
         ],
         [
            "Test3",
            "0.5000",
            "0",
            "0",
            ""
         ],
         [
            "Test4",
            "0,5000",
            "0",
            "0",
            ""
         ],
         [
            "Test5",
            "1",
            "1",
            "1",
            ""
         ]
      ],
      "bbox":[
         [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
         ],
         [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
         ],
         [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
         ],
         [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
         ],
         [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
         ]
      ],
      "span":[
         
      ],
      "score":[[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]]

   },
   "is_big_table":True
}

predict = {'shape': [4, 6], 'column-header': {'bbox': [[[0, 0, 0, 0]], [[0, 0, 0, 0]], [[0, 0, 0, 0]], [[0, 0, 0, 0]]], 'content': [['처방 의약품의 명칭'], ['1회 투약량'], ['1회 투여횟수'], ['총 투약일수']], 'score': [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], 'position': [0, 0, 3, 0], 'span': []}, 'body': {'bbox': [[[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]]], 'content': [['Test1', 5.0, 5, 5], ['Test2', 5.0, 5, 5], ['Test3', 0.5, 0, 0], ['Test4', 0.5, 0, 0], ['Test5', 1.0, 1, 1]], 'score': [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], 'position': [0, 1, 3, 5], 'span': []}, 'is_big_table': True}


def test_MD_PRS_content_str_digit2float():
   """
      1회투약량 테스트 
      
      TEST1: 5,0000 -> 5.0
      TEST2: 5.0000 -> 5.0
      TEST3: 0.5000 -> 0.5
      TEST4: 0,5000 -> 0.5
      TEST5: 1 -> 1.0
   """
   pp = PrescriptionPP(relations = None, doc_type = None, list_of_string = None)
   assert pp.get_templatized_big_table(input_params) == predict